First we install needed libraries.

Then, we upload needed json file

In [1]:
import pandas as pd

df2 = pd.read_json("transactions_3000.json")

df2

     transaction_id customer_id       date    amount           type
0                T1        C398 2025-12-30  19331.70  Card Purchase
1                T2        C563 2025-04-15   1205.53            Fee
2                T3       C1443 2025-08-04  15797.45     Withdrawal
3                T4       C1321 2025-11-11  13065.22        Deposit
4                T5       C1121 2024-04-28   7899.69       Transfer
...             ...         ...        ...       ...            ...
2995          T2996        C466 2024-10-05   5126.16            Fee
2996          T2997        C236 2024-06-28  12192.05        Deposit
2997          T2998        C646 2025-09-18   5382.45            POS
2998          T2999        C353 2024-02-19   7729.90        Payment
2999          T3000        C713 2025-01-24   5748.51       Transfer

[3000 rows x 5 columns]

After importing data and making sure everything is working.
We need to work with data frame. Doing the works like: Cleaning, Sorting.

1. We need to check if we have any null or nan values. if we have them we need to delete those. Since they do not provide any valuable info.

In [ ]:
df2.isnull().sum()
df2.isna().sum()

transaction_id    0
customer_id       0
date              0
amount            0
type              0
dtype: int64

After that. We check for all of the negative amount value in amount column.

In [ ]:
# df[df["amount"] <= 0]

df2 = df2[df2["amount"] > 0]

     transaction_id customer_id       date    amount           type
0                T1        C398 2025-12-30  19331.70  Card Purchase
1                T2        C563 2025-04-15   1205.53            Fee
2                T3       C1443 2025-08-04  15797.45     Withdrawal
3                T4       C1321 2025-11-11  13065.22        Deposit
4                T5       C1121 2024-04-28   7899.69       Transfer
...             ...         ...        ...       ...            ...
2995          T2996        C466 2024-10-05   5126.16            Fee
2996          T2997        C236 2024-06-28  12192.05        Deposit
2997          T2998        C646 2025-09-18   5382.45            POS
2998          T2999        C353 2024-02-19   7729.90        Payment
2999          T3000        C713 2025-01-24   5748.51       Transfer

[2925 rows x 5 columns]

After removing the negative value we need to check the date of the transactions since we are trying to check only the current year we will remove the transactions happened before 2024.

In [ ]:
df2 = df2[df2["date"].dt.year == 2025]

df2

     transaction_id customer_id       date    amount           type
0                T1        C398 2025-12-30  19331.70  Card Purchase
1                T2        C563 2025-04-15   1205.53            Fee
2                T3       C1443 2025-08-04  15797.45     Withdrawal
3                T4       C1321 2025-11-11  13065.22        Deposit
6                T7       C1453 2025-04-15   1713.31         Online
...             ...         ...        ...       ...            ...
2990          T2991        C683 2025-10-23   2269.15       Transfer
2991          T2992       C1564 2025-07-07  16220.42        Payment
2993          T2994        C845 2025-12-31  15794.40        Payment
2997          T2998        C646 2025-09-18   5382.45            POS
2999          T3000        C713 2025-01-24   5748.51       Transfer

[1491 rows x 5 columns]

Since now we have clean data we can export it to csv file to upload it to our sql database afterwords.

In [ ]:
df2.to_csv("cleaned_transactions.csv", index=False)

NameError: name 'df' is not defined

In [2]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  3000 non-null   object
 1   customer_id     3000 non-null   object
 2   date            3000 non-null   datetime64[ns]
 3   amount          3000 non-null   float64
 4   type            3000 non-null   object
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 117.3+ KB